InformationRegisters/ОтсутствияНаОснованииОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтсутствияНаОснованииОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтсутствия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОтсутствияНаОснованииОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбучениеРазвитиеВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция АдресМероприятийПрограммыОбучения(Знач ТаблицаПрограммаОбученияРеквизит, Знач ФормаУникальныйИдентификатор) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПрограммаОбученияРеквизит.Выгрузить(, "Мероприятие").ВыгрузитьКолонку("Мероприятие"), ФормаУникальныйИдентификатор);
	
КонецФункции

Функция АдресЦелейРазвития(Знач ТаблицаПрограммаОбученияРеквизит, Знач ФормаУникальныйИдентификатор) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПрограммаОбученияРеквизит.Выгрузить(, "Цель").ВыгрузитьКолонку("Цель"), ФормаУникальныйИдентификатор);
	
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

Функция СотрудникиПоОрганизациям(Ссылка) Экспорт

	Возврат ОбучениеРазвитие.ПолучитьСотрудниковПоОрганизациям(Ссылка);

КонецФункции

// Проверяет наличие документов отсутствия, связанных с указанным документом обучения.
//
// Параметры:
//   ДокументОбучения - ДокументСсылка.ОбучениеРазвитиеСотрудников - Документ обучения, для которого выполняется проверка
//
// Возвращаемое значение:
//   Булево - Истина, если документы отсутствия существуют, Ложь в противном случае
Функция ЕстьДокументыОтсутствияПоОбучению(ДокументОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия
		|ИЗ
		|	РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
		|ГДЕ
		|	ОтсутствияНаОснованииОбучения.ДокументОснование = &ДокументОбучения";
		
	Запрос.УстановитьПараметр("ДокументОбучения", ДокументОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

#КонецОбласти
